In [1]:
import pandas as pd
import numpy as np

C:\Users\user\AppData\Local\Temp\ipykernel_9500\2162656668.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [2]:
dict1 = {
    'name': ['Ashish', 'Harry', 'Rohan', 'Subh'],
    'salary': [92, 34, 24, 17],
    'city': ['Rampur', 'Kolkata', 'Jaipur', 'Patna']
}

In [3]:
df = pd.DataFrame(dict1)

In [5]:
df

     name  salary     city
0  Ashish      92   Rampur
1   Harry      34  Kolkata
2   Rohan      24   Jaipur
3    Subh      17    Patna

In [10]:
df.to_csv('../../data_folder/s1/friendss1.csv')

In [11]:
df.to_csv('../../data_folder/s1/friendss1_without_index.csv', index=False)

In [12]:
df.head()

     name  salary     city
0  Ashish      92   Rampur
1   Harry      34  Kolkata
2   Rohan      24   Jaipur
3    Subh      17    Patna

In [13]:
df.head(2)

     name  salary     city
0  Ashish      92   Rampur
1   Harry      34  Kolkata

In [14]:
df.tail()

     name  salary     city
0  Ashish      92   Rampur
1   Harry      34  Kolkata
2   Rohan      24   Jaipur
3    Subh      17    Patna

In [15]:
df.tail(2)

    name  salary    city
2  Rohan      24  Jaipur
3   Subh      17   Patna

In [16]:
df.describe()

         salary
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000

In [17]:
df = pd.read_csv('../../data_folder/ashish.csv')

In [18]:
df

   Train  Speed     City
0    123     12   Rampur
1    456     23  Kolkata
2    789     34   Jaipur
3     12     45    Patna

In [20]:
df['Speed']

0    12
1    23
2    34
3    45
Name: Speed, dtype: int64

In [21]:
df['Speed'][0]

12

In [22]:
df['Speed'][0] = 50

C:\Users\user\AppData\Local\Temp\ipykernel_9500\2609676089.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Speed'][0] = 50

In [23]:
df

   Train  Speed     City
0    123     50   Rampur
1    456     23  Kolkata
2    789     34   Jaipur
3     12     45    Patna

In [24]:
df.to_csv('../../data_folder/s1/updated_ashish.csv', index=False)